Системы контроля версий. Цели использования Особенности работы. Локальный и глобальный репозитории на примере Git. 
Системы контроля версий. “Перемещение” между состояниями. Сброс изменений. На примере Git.
Системы контроля версий. Создание и использование ветвей разработки на примере Git. 
Системы контроля версий. Pull Request, Rebase, cherry pick в Git. Примеры использования.
Основы HTML. Структура HTML-документа. Теги основных элементов <h1>, <p>, <img>, <a>.... На примере простейшей веб-страницы. 
Основы HTML. Составные теги <table>, <ul>, <ol>. Примеры использования. 
Основы CSS. Способы подключения css в html документ. Селектор, способы оформления для каждого вида подключения. Пример страницы с использованием каждого способа.
Основы CSS. Каскадная модель работы CSS. Модификатор !important. Блочная структура страницы. Тег <div>, <span>. Пример страницы с использованием и дизайном.
Основы CSS. Медиа запросы. Цели применения, синтаксис. Пример работы.
Основы SQL. Создание базы данных. Создание таблицы. Ограничение полей (unique, not null). Типы данных. Удаление таблицы. На примере SQLite. 
Основы SQL. Добавление данных. Изменение данных. Простейшие запросы на выборку данных из таблицы. На примере SQLite. 
Основы SQL. Внешние ключи. Вложенные запросы к базе данных для выборки данных из нескольких таблиц. Создание индексов для полей б.д. На примере SQLite. 
Основы SQL. Объединение таблиц с JOIN, UNION. Транзакции. На примере SQLite. 
